QX-C2000-DSP/f280049revb_evb_examples/libs/driverlib/ipc.h
#ifndef IPC_H
#define IPC_H

//*****************************************************************************
//
// If building with a C++ compiler, make all of the definitions in this header
// have a C binding.
//
//*****************************************************************************
#ifdef __cplusplus
extern "C" {
#endif

//*****************************************************************************
//
//! \addtogroup ipc_api IPC
//! \brief This module is used for inter-processor communications.
//! @{
//
//*****************************************************************************

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_ipc.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "cpu.h"
#include "debug.h"

#include "f28004x_device.h"

//*****************************************************************************
//
// Defines for the APIs
//
//*****************************************************************************
//*****************************************************************************
//
// Driver configuration macros
//
//*****************************************************************************
#define IPC_MSGQ_SUPPORT 1U

//
// Number of IPC messages in circular buffer (must be interval of 2)
//
#define IPC_BUFFER_SIZE 4U

//
// Number of IPC interrupts using circular buffer (must be same number on both
// CPUs)
//
#define IPC_NUM_OF_INTERRUPTS 4U

//*****************************************************************************
//
// Values that can be passed as parameter flags in all the IPC API functions.
//
//*****************************************************************************
#ifndef IPC_FLAGS_DEFINED
#define IPC_FLAGS_DEFINED
#define IPC_NO_FLAG  0x00000000U //!< NO FLAG
#define IPC_FLAG0    0x00000001U //!< IPC FLAG 0
#define IPC_FLAG1    0x00000002U //!< IPC FLAG 1
#define IPC_FLAG2    0x00000004U //!< IPC FLAG 2
#define IPC_FLAG3    0x00000008U //!< IPC FLAG 3
#define IPC_FLAG4    0x00000010U //!< IPC FLAG 4
#define IPC_FLAG5    0x00000020U //!< IPC FLAG 5
#define IPC_FLAG6    0x00000040U //!< IPC FLAG 6
#define IPC_FLAG7    0x00000080U //!< IPC FLAG 7
#define IPC_FLAG8    0x00000100U //!< IPC FLAG 8
#define IPC_FLAG9    0x00000200U //!< IPC FLAG 9
#define IPC_FLAG10   0x00000400U //!< IPC FLAG 10
#define IPC_FLAG11   0x00000800U //!< IPC FLAG 11
#define IPC_FLAG12   0x00001000U //!< IPC FLAG 12
#define IPC_FLAG13   0x00002000U //!< IPC FLAG 13
#define IPC_FLAG14   0x00004000U //!< IPC FLAG 14
#define IPC_FLAG15   0x00008000U //!< IPC FLAG 15
#define IPC_FLAG16   0x00010000U //!< IPC FLAG 16
#define IPC_FLAG17   0x00020000U //!< IPC FLAG 17
#define IPC_FLAG18   0x00040000U //!< IPC FLAG 18
#define IPC_FLAG19   0x00080000U //!< IPC FLAG 19
#define IPC_FLAG20   0x00100000U //!< IPC FLAG 20
#define IPC_FLAG21   0x00200000U //!< IPC FLAG 21
#define IPC_FLAG22   0x00400000U //!< IPC FLAG 22
#define IPC_FLAG23   0x00800000U //!< IPC FLAG 23
#define IPC_FLAG24   0x01000000U //!< IPC FLAG 24
#define IPC_FLAG25   0x02000000U //!< IPC FLAG 25
#define IPC_FLAG26   0x04000000U //!< IPC FLAG 26
#define IPC_FLAG27   0x08000000U //!< IPC FLAG 27
#define IPC_FLAG28   0x10000000U //!< IPC FLAG 28
#define IPC_FLAG29   0x20000000U //!< IPC FLAG 29
#define IPC_FLAG30   0x40000000U //!< IPC FLAG 30
#define IPC_FLAG31   0x80000000U //!< IPC FLAG 31
#define IPC_FLAG_ALL 0xFFFFFFFFU //!< All IPC flags
#endif

//*****************************************************************************
//
// Values that can be passed as parameter ipcInt in
// IPC_registerInterrupt and IPC_unregisterInterrupt functions.
// Please refer to the datasheet for the actual number of interrupts available
// for each IPC instance
//
//*****************************************************************************
#define IPC_INT0 0x0U //!< IPC Interrupt 0
#define IPC_INT1 0x1U //!< IPC Interrupt 1
#define IPC_INT2 0x2U //!< IPC Interrupt 2
#define IPC_INT3 0x3U //!< IPC Interrupt 3
#define IPC_INT4 0x4U //!< IPC Interrupt 4
#define IPC_INT5 0x5U //!< IPC Interrupt 5
#define IPC_INT6 0x6U //!< IPC Interrupt 6
#define IPC_INT7 0x7U //!< IPC Interrupt 7

//*****************************************************************************
//
// Values that can be passed as parameter addrCorrEnable in
// IPC_sendCommand, IPC_readCommand, IPC_sendMessageToQueue and
// IPC_readMessageFromQueue functions.
//
//*****************************************************************************
#define IPC_ADDR_CORRECTION_ENABLE  true
#define IPC_ADDR_CORRECTION_DISABLE false

//*****************************************************************************
//
// Values that can be passed as parameter block in
// IPC_sendMessageToQueue and IPC_readMessageFromQueue functions.
//
//*****************************************************************************
#define IPC_BLOCKING_CALL    true
#define IPC_NONBLOCKING_CALL false

//*****************************************************************************
//
// Internal macros used for message queue implementation
//
//*****************************************************************************
#define IPC_MAX_BUFFER_INDEX (IPC_BUFFER_SIZE - 1U)

//*****************************************************************************
//
// Enums for the APIs
//
//*****************************************************************************

//*****************************************************************************
//
//! Values that can be passed as parameter \e ipcType in all the driver
//! functions
//
//*****************************************************************************
typedef enum
{
    IPC_CPU1_L_CPU2_R, //!< CPU1 - Local core, CPU2 - Remote core
    IPC_CPU2_L_CPU1_R, //!< CPU2 - Local core, CPU1 - Remote core
    IPC_TOTAL_NUM
} IPC_Type_t;

//*****************************************************************************
//
// Internal structs for register and messaage queue accesses
//
//*****************************************************************************
typedef struct
{
    uint32_t IPC_SET;
    uint32_t IPC_CLR;
    uint32_t IPC_FLG;
    uint32_t IPC_STS;
    uint32_t IPC_ACK;
} IPC_Flag_Ctr_Reg_t;

typedef struct
{
    uint32_t IPC_SENDCOM;
    uint32_t IPC_SENDADDR;
    uint32_t IPC_SENDDATA;
    uint32_t IPC_LOCALREPLY;
} IPC_SendCmd_Reg_t;

typedef struct
{
    uint32_t IPC_RECVCOM;
    uint32_t IPC_RECVADDR;
    uint32_t IPC_RECVDATA;
    uint32_t IPC_REMOTEREPLY;
} IPC_RecvCmd_Reg_t;

// typedef struct
//{
//     uint32_t IPC_BOOTSTS;
//     uint32_t IPC_BOOTMODE;
// }IPC_Boot_Pump_Reg_t;

